1. Import Pandas and Create a DataFrame

In [1]:
import pandas as pd

# Creating a DataFrame from a dictionary
def setup() -> pd.DataFrame:
    data = {
        'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [35, 25, 30],
        'City': ['New York', 'Los Angeles', 'Chicago']
    }
    df = pd.DataFrame(data)
    return df
df = setup()
df

      Name  Age         City
0    Alice   35     New York
1      Bob   25  Los Angeles
2  Charlie   30      Chicago

2. View DataFrame

In [2]:
print(df)

      Name  Age         City
0    Alice   35     New York
1      Bob   25  Los Angeles
2  Charlie   30      Chicago

3. Access Columns

In [3]:
# Access a single column
print(df['Name'])

# Access multiple columns
print(df[['Name', 'Age']])

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object
      Name  Age
0    Alice   35
1      Bob   25
2  Charlie   30

4. Access Rows by Index

In [4]:
# Access a single row by index
print(df.iloc[1])  # Row with index 1

# Access multiple rows by index
print(df.iloc[0:2])  # Rows with index 0 and 1

Name            Bob
Age              25
City    Los Angeles
Name: 1, dtype: object
    Name  Age         City
0  Alice   35     New York
1    Bob   25  Los Angeles

5. Filter Data

In [5]:
# Filter rows based on a condition
print(df[df['Age'] > 28])

      Name  Age      City
0    Alice   35  New York
2  Charlie   30   Chicago

Add a New Row

In [6]:
# Using pd.concat to Insert a Row

# New row to be added
new_row = pd.DataFrame([['David', 45, 'Chicago']], columns=['Name', 'Age', 'City'])

# Concatenate DataFrames
df = pd.concat([df, new_row], ignore_index=True)
df

      Name  Age         City
0    Alice   35     New York
1      Bob   25  Los Angeles
2  Charlie   30      Chicago
3    David   45      Chicago

Add a New Column

In [7]:
# Adding a new column
df['Country'] = 'USA'
df

      Name  Age         City Country
0    Alice   35     New York     USA
1      Bob   25  Los Angeles     USA
2  Charlie   30      Chicago     USA
3    David   45      Chicago     USA

Modify Existing Columns

In [8]:
# Modify an existing column
df['Age'] = df['Age'] + 1
df

      Name  Age         City Country
0    Alice   36     New York     USA
1      Bob   26  Los Angeles     USA
2  Charlie   31      Chicago     USA
3    David   46      Chicago     USA

Drop a Column

In [9]:
# Drop a column
df = df.drop('Country', axis=1)
df

      Name  Age         City
0    Alice   36     New York
1      Bob   26  Los Angeles
2  Charlie   31      Chicago
3    David   46      Chicago

Drop a Row

In [10]:
# Drop a row by index
df = df.drop(1, axis=0)
df

      Name  Age      City
0    Alice   36  New York
2  Charlie   31   Chicago
3    David   46   Chicago

Reset Index

In [11]:
# Resetting the index of the DataFrame
df = df.reset_index(drop=True)
df

      Name  Age      City
0    Alice   36  New York
1  Charlie   31   Chicago
2    David   46   Chicago

Group By and Aggregate

In [12]:
print(df)
# Group by a column and aggregate
df_grouped = df.groupby('City').agg({'Age': 'mean'})
df_grouped

      Name  Age      City
0    Alice   36  New York
1  Charlie   31   Chicago
2    David   46   Chicago

           Age
City
Chicago   38.5
New York  36.0

Sort DataFrame

In [13]:
# Sort by a column
df_sorted = df.sort_values(by='Age')
df_sorted

      Name  Age      City
1  Charlie   31   Chicago
0    Alice   36  New York
2    David   46   Chicago

# Load/Store DataFrame from/to CSV

Save DataFrame to CSV

In [14]:
# df.to_csv('data.csv', index=False)

Load DataFrame from CSV

In [15]:
# df = pd.read_csv('data.csv')

# Data Clean

Data cleaning means fixing bad data in your data set.

Bad data could be:

- Empty cells
- Data in wrong format
- Wrong data
- Duplicates

## Empty Cells

### Representing Empty Cells

1. Using `NAN` (Not a Number): 
The most common way to represent empty cell in Pandas is to use `np.nan` from `numpy`.

2. Using `None`

### Cleaning Empty Cells

In [16]:
import pandas as pd

# Creating a DataFrame with None values
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [200, None, 35],  # Age is missing for Bob
    'City': ['New York', 'Los Angeles', '']  # City is missing for Charlie
}
df = pd.DataFrame(data)

print(df)

      Name    Age         City
0    Alice  200.0     New York
1      Bob    NaN  Los Angeles
2  Charlie   35.0

Check for Missing Data

In [17]:
print(df.isna())  # Boolean DataFrame showing where NaNs are present
print(df.isna().sum())  # Count of NaNs in each column

    Name    Age   City
0  False  False  False
1  False   True  False
2  False  False  False
Name    0
Age     1
City    0
dtype: int64

Drop Missing Data

In [18]:
df_dropped = df.dropna()  # Drop rows with any NaNs
df_dropped

      Name    Age      City
0    Alice  200.0  New York
2  Charlie   35.0

Fill Missing Data

In [19]:
df_filled = df.fillna('Unknown')  # Fill NaNs with a specified value
df_filled

      Name      Age         City
0    Alice    200.0     New York
1      Bob  Unknown  Los Angeles
2  Charlie     35.0

Fill Only For Specified Columns

In [20]:
df_filled = df["Age"].fillna('Unknown')
print(df_filled)

df_filled = df.copy()
df_filled['Age'].fillna('Unknown', inplace=True)
print(df_filled)

0      200.0
1    Unknown
2       35.0
Name: Age, dtype: object
      Name      Age         City
0    Alice    200.0     New York
1      Bob  Unknown  Los Angeles
2  Charlie     35.0

/var/folders/qw/qfmpln097v9c1g7nbqm5wvkr0000gn/T/ipykernel_87683/4239524588.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_filled['Age'].fillna('Unknown', inplace=True)
/var/folders/qw/qfmpln097v9c1g7nbqm5wvkr0000gn/T/ipykernel_87683/4239524588.py:5: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Unknown' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df_filled['Age'].fillna('Unknown', inplace=True)

Fill Using `mean()`, `median()`, or `mode()`

**Mode** = the value that appears most frequently.

In [21]:
x = df['Age'].mean()
# x = df['Age'].median()
# x = df['Age'].mode()[0]
print(f"x = {x}")

df_filled = df.copy()
df_filled['Age'] = df_filled['Age'].fillna(x)
df_filled

x = 117.5

      Name    Age         City
0    Alice  200.0     New York
1      Bob  117.5  Los Angeles
2  Charlie   35.0

Replace Missing Data

In [22]:
df_replaced = df.replace('', 'Unknown')  # Replace empty strings with 'Unknown'
df_replaced

      Name    Age         City
0    Alice  200.0     New York
1      Bob    NaN  Los Angeles
2  Charlie   35.0      Unknown

## Cleaning Data of Wrong Format

Two options: remove the rows, or convert all cells in the columns into the same format.

## Fixing Wrong Data

Replacing Value

In [23]:
df_fixed = df.copy()
for x in df_fixed.index:
  if df_fixed.loc[x, "Age"] > 120:
    df_fixed.loc[x, "Age"] = 120
df_fixed

      Name    Age         City
0    Alice  120.0     New York
1      Bob    NaN  Los Angeles
2  Charlie   35.0

Removing Rows

In [24]:
df_fixed = df.copy()
for x in df_fixed.index:
  if df_fixed.loc[x, 'Age'] > 120:
    df_fixed.drop(x, inplace = True)
df_fixed

      Name   Age         City
1      Bob   NaN  Los Angeles
2  Charlie  35.0

## Removing Duplicates

To discover duplicates, we can use the `duplicated()` method. The `duplicated()` method returns a Boolean values for each row

To remove duplicates, use the `drop_duplicates()` method.